grevaillot/svd_tools/headers/STM32G474xx/hrtim_timf.h
#pragma once 

/* --- HRTIM_TIMF: High Resolution Timer: TIMF ---------------------- */

/** @defgroup hrtim_timf_registers High Resolution Timer: TIMF Register
@{*/

/** HRTIM_TIMF_TIMFCR Timerx Control Register **/
#define HRTIM_TIMF_TIMFCR			MMIO32(HRTIM_TIMF_BASE + 0x00)
/** HRTIM_TIMF_TIMFISR Timerx Interrupt Status Register **/
#define HRTIM_TIMF_TIMFISR			MMIO32(HRTIM_TIMF_BASE + 0x04)
/** HRTIM_TIMF_TIMFICR Timerx Interrupt Clear Register **/
#define HRTIM_TIMF_TIMFICR			MMIO32(HRTIM_TIMF_BASE + 0x08)
/** HRTIM_TIMF_TIMFDIER TIMxDIER **/
#define HRTIM_TIMF_TIMFDIER			MMIO32(HRTIM_TIMF_BASE + 0x0c)
/** HRTIM_TIMF_CNTFR Timerx Counter Register **/
#define HRTIM_TIMF_CNTFR			MMIO32(HRTIM_TIMF_BASE + 0x10)
/** HRTIM_TIMF_PERFR Timerx Period Register **/
#define HRTIM_TIMF_PERFR			MMIO32(HRTIM_TIMF_BASE + 0x14)
/** HRTIM_TIMF_REPFR Timerx Repetition Register **/
#define HRTIM_TIMF_REPFR			MMIO32(HRTIM_TIMF_BASE + 0x18)
/** HRTIM_TIMF_CMP1FR Timerx Compare 1 Register **/
#define HRTIM_TIMF_CMP1FR			MMIO32(HRTIM_TIMF_BASE + 0x1c)
/** HRTIM_TIMF_CMP1CFR Timerx Compare 1 Compound Register **/
#define HRTIM_TIMF_CMP1CFR			MMIO32(HRTIM_TIMF_BASE + 0x20)
/** HRTIM_TIMF_CMP2FR Timerx Compare 2 Register **/
#define HRTIM_TIMF_CMP2FR			MMIO32(HRTIM_TIMF_BASE + 0x24)
/** HRTIM_TIMF_CMP3FR Timerx Compare 3 Register **/
#define HRTIM_TIMF_CMP3FR			MMIO32(HRTIM_TIMF_BASE + 0x28)
/** HRTIM_TIMF_CMP4FR Timerx Compare 4 Register **/
#define HRTIM_TIMF_CMP4FR			MMIO32(HRTIM_TIMF_BASE + 0x2c)
/** HRTIM_TIMF_CPT1FR Timerx Capture 1 Register **/
#define HRTIM_TIMF_CPT1FR			MMIO32(HRTIM_TIMF_BASE + 0x30)
/** HRTIM_TIMF_CPT2FR Timerx Capture 2 Register **/
#define HRTIM_TIMF_CPT2FR			MMIO32(HRTIM_TIMF_BASE + 0x34)
/** HRTIM_TIMF_DTFR Timerx Deadtime Register **/
#define HRTIM_TIMF_DTFR			MMIO32(HRTIM_TIMF_BASE + 0x38)
/** HRTIM_TIMF_SETF1R Timerx Output1 Set Register **/
#define HRTIM_TIMF_SETF1R			MMIO32(HRTIM_TIMF_BASE + 0x3c)
/** HRTIM_TIMF_RSTE1R Timerx Output1 Reset Register **/
#define HRTIM_TIMF_RSTE1R			MMIO32(HRTIM_TIMF_BASE + 0x40)
/** HRTIM_TIMF_SETF2R Timerx Output2 Set Register **/
#define HRTIM_TIMF_SETF2R			MMIO32(HRTIM_TIMF_BASE + 0x44)
/** HRTIM_TIMF_RSTF2R Timerx Output2 Reset Register **/
#define HRTIM_TIMF_RSTF2R			MMIO32(HRTIM_TIMF_BASE + 0x48)
/** HRTIM_TIMF_EEFFR1 Timerx External Event Filtering Register 1 **/
#define HRTIM_TIMF_EEFFR1			MMIO32(HRTIM_TIMF_BASE + 0x4c)
/** HRTIM_TIMF_EEFFR2 Timerx External Event Filtering Register 2 **/
#define HRTIM_TIMF_EEFFR2			MMIO32(HRTIM_TIMF_BASE + 0x50)
/** HRTIM_TIMF_RSTFR TimerA Reset Register **/
#define HRTIM_TIMF_RSTFR			MMIO32(HRTIM_TIMF_BASE + 0x54)
/** HRTIM_TIMF_CHPFR Timerx Chopper Register **/
#define HRTIM_TIMF_CHPFR			MMIO32(HRTIM_TIMF_BASE + 0x58)
/** HRTIM_TIMF_CPT1FCR Timerx Capture 2 Control Register **/
#define HRTIM_TIMF_CPT1FCR			MMIO32(HRTIM_TIMF_BASE + 0x5c)
/** HRTIM_TIMF_CPT2FCR CPT2xCR **/
#define HRTIM_TIMF_CPT2FCR			MMIO32(HRTIM_TIMF_BASE + 0x60)
/** HRTIM_TIMF_OUTFR Timerx Output Register **/
#define HRTIM_TIMF_OUTFR			MMIO32(HRTIM_TIMF_BASE + 0x64)
/** HRTIM_TIMF_FLTFR Timerx Fault Register **/
#define HRTIM_TIMF_FLTFR			MMIO32(HRTIM_TIMF_BASE + 0x68)
/** HRTIM_TIMF_TIMFCR2 HRTIM Timerx Control Register 2 **/
#define HRTIM_TIMF_TIMFCR2			MMIO32(HRTIM_TIMF_BASE + 0x6c)
/** HRTIM_TIMF_FEEFR3 HRTIM Timerx External Event Filtering Register 3 **/
#define HRTIM_TIMF_FEEFR3			MMIO32(HRTIM_TIMF_BASE + 0x70)

/**@}*/


/** @defgroup hrtim_timf_timfcr TIMFCR Timerx Control Register
@{*/


#define HRTIM_TIMF_TIMFCR_UPDGAT_SHIFT		28
#define HRTIM_TIMF_TIMFCR_UPDGAT_MASK		0x0f
/** @defgroup hrtim_timf_timfcr_updgat UPDGAT Update Gating
@{*/
/**@}*/

/** HRTIM_TIMF_TIMFCR_PREEN Preload enable **/
#define HRTIM_TIMF_TIMFCR_PREEN		(1 << 27)

#define HRTIM_TIMF_TIMFCR_DACSYNC_SHIFT		25
#define HRTIM_TIMF_TIMFCR_DACSYNC_MASK		0x03
/** @defgroup hrtim_timf_timfcr_dacsync DACSYNC AC Synchronization
@{*/
/**@}*/

/** HRTIM_TIMF_TIMFCR_MSTU Master Timer update **/
#define HRTIM_TIMF_TIMFCR_MSTU		(1 << 24)
/** HRTIM_TIMF_TIMFCR_TDU TDU **/
#define HRTIM_TIMF_TIMFCR_TDU		(1 << 22)
/** HRTIM_TIMF_TIMFCR_TCU TCU **/
#define HRTIM_TIMF_TIMFCR_TCU		(1 << 21)
/** HRTIM_TIMF_TIMFCR_TBU TBU **/
#define HRTIM_TIMF_TIMFCR_TBU		(1 << 20)
/** HRTIM_TIMF_TIMFCR_TAU TAU **/
#define HRTIM_TIMF_TIMFCR_TAU		(1 << 19)
/** HRTIM_TIMF_TIMFCR_TxRSTU Timerx reset update **/
#define HRTIM_TIMF_TIMFCR_TxRSTU		(1 << 18)
/** HRTIM_TIMF_TIMFCR_TxREPU Timer x Repetition update **/
#define HRTIM_TIMF_TIMFCR_TxREPU		(1 << 17)

#define HRTIM_TIMF_TIMFCR_DELCMP4_SHIFT		14
#define HRTIM_TIMF_TIMFCR_DELCMP4_MASK		0x03
/** @defgroup hrtim_timf_timfcr_delcmp4 DELCMP4 Delayed CMP4 mode
@{*/
/**@}*/


#define HRTIM_TIMF_TIMFCR_DELCMP2_SHIFT		12
#define HRTIM_TIMF_TIMFCR_DELCMP2_MASK		0x03
/** @defgroup hrtim_timf_timfcr_delcmp2 DELCMP2 Delayed CMP2 mode
@{*/
/**@}*/

/** HRTIM_TIMF_TIMFCR_SYNCSTRTx Synchronization Starts Timer x **/
#define HRTIM_TIMF_TIMFCR_SYNCSTRTx		(1 << 11)
/** HRTIM_TIMF_TIMFCR_SYNCRSTx Synchronization Resets Timer x **/
#define HRTIM_TIMF_TIMFCR_SYNCRSTx		(1 << 10)
/** HRTIM_TIMF_TIMFCR_RSYNCU Re-Synchronized Update **/
#define HRTIM_TIMF_TIMFCR_RSYNCU		(1 << 9)

#define HRTIM_TIMF_TIMFCR_INTLVD_SHIFT		7
#define HRTIM_TIMF_TIMFCR_INTLVD_MASK		0x03
/** @defgroup hrtim_timf_timfcr_intlvd INTLVD Interleaved mode
@{*/
/**@}*/

/** HRTIM_TIMF_TIMFCR_PSHPLL Push-Pull mode enable **/
#define HRTIM_TIMF_TIMFCR_PSHPLL		(1 << 6)
/** HRTIM_TIMF_TIMFCR_HALF Half mode enable **/
#define HRTIM_TIMF_TIMFCR_HALF		(1 << 5)
/** HRTIM_TIMF_TIMFCR_RETRIG Re-triggerable mode **/
#define HRTIM_TIMF_TIMFCR_RETRIG		(1 << 4)
/** HRTIM_TIMF_TIMFCR_CONT Continuous mode **/
#define HRTIM_TIMF_TIMFCR_CONT		(1 << 3)

#define HRTIM_TIMF_TIMFCR_CK_PSCx_SHIFT		0
#define HRTIM_TIMF_TIMFCR_CK_PSCx_MASK		0x07
/** @defgroup hrtim_timf_timfcr_ck_pscx CKPSCx HRTIM Timer x Clock prescaler
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timf_timfisr TIMFISR Timerx Interrupt Status Register
@{*/

/** HRTIM_TIMF_TIMFISR_O2CPY Output 2 Copy **/
#define HRTIM_TIMF_TIMFISR_O2CPY		(1 << 21)
/** HRTIM_TIMF_TIMFISR_O1CPY Output 1 Copy **/
#define HRTIM_TIMF_TIMFISR_O1CPY		(1 << 20)
/** HRTIM_TIMF_TIMFISR_O2STAT Output 2 State **/
#define HRTIM_TIMF_TIMFISR_O2STAT		(1 << 19)
/** HRTIM_TIMF_TIMFISR_O1STAT Output 1 State **/
#define HRTIM_TIMF_TIMFISR_O1STAT		(1 << 18)
/** HRTIM_TIMF_TIMFISR_IPPSTAT Idle Push Pull Status **/
#define HRTIM_TIMF_TIMFISR_IPPSTAT		(1 << 17)
/** HRTIM_TIMF_TIMFISR_CPPSTAT Current Push Pull Status **/
#define HRTIM_TIMF_TIMFISR_CPPSTAT		(1 << 16)
/** HRTIM_TIMF_TIMFISR_DLYPRT Delayed Protection Flag **/
#define HRTIM_TIMF_TIMFISR_DLYPRT		(1 << 14)
/** HRTIM_TIMF_TIMFISR_RST Reset Interrupt Flag **/
#define HRTIM_TIMF_TIMFISR_RST		(1 << 13)
/** HRTIM_TIMF_TIMFISR_RSTx2 Output 2 Reset Interrupt Flag **/
#define HRTIM_TIMF_TIMFISR_RSTx2		(1 << 12)
/** HRTIM_TIMF_TIMFISR_SETx2 Output 2 Set Interrupt Flag **/
#define HRTIM_TIMF_TIMFISR_SETx2		(1 << 11)
/** HRTIM_TIMF_TIMFISR_RSTx1 Output 1 Reset Interrupt Flag **/
#define HRTIM_TIMF_TIMFISR_RSTx1		(1 << 10)
/** HRTIM_TIMF_TIMFISR_SETx1 Output 1 Set Interrupt Flag **/
#define HRTIM_TIMF_TIMFISR_SETx1		(1 << 9)
/** HRTIM_TIMF_TIMFISR_CPT2 Capture2 Interrupt Flag **/
#define HRTIM_TIMF_TIMFISR_CPT2		(1 << 8)
/** HRTIM_TIMF_TIMFISR_CPT1 Capture1 Interrupt Flag **/
#define HRTIM_TIMF_TIMFISR_CPT1		(1 << 7)
/** HRTIM_TIMF_TIMFISR_UPD Update Interrupt Flag **/
#define HRTIM_TIMF_TIMFISR_UPD		(1 << 6)
/** HRTIM_TIMF_TIMFISR_REP Repetition Interrupt Flag **/
#define HRTIM_TIMF_TIMFISR_REP		(1 << 4)
/** HRTIM_TIMF_TIMFISR_CMP4 Compare 4 Interrupt Flag **/
#define HRTIM_TIMF_TIMFISR_CMP4		(1 << 3)
/** HRTIM_TIMF_TIMFISR_CMP3 Compare 3 Interrupt Flag **/
#define HRTIM_TIMF_TIMFISR_CMP3		(1 << 2)
/** HRTIM_TIMF_TIMFISR_CMP2 Compare 2 Interrupt Flag **/
#define HRTIM_TIMF_TIMFISR_CMP2		(1 << 1)
/** HRTIM_TIMF_TIMFISR_CMP1 Compare 1 Interrupt Flag **/
#define HRTIM_TIMF_TIMFISR_CMP1		(1 << 0)

/**@}*/

/** @defgroup hrtim_timf_timficr TIMFICR Timerx Interrupt Clear Register
@{*/

/** HRTIM_TIMF_TIMFICR_DLYPRTC Delayed Protection Flag Clear **/
#define HRTIM_TIMF_TIMFICR_DLYPRTC		(1 << 14)
/** HRTIM_TIMF_TIMFICR_RSTC Reset Interrupt flag Clear **/
#define HRTIM_TIMF_TIMFICR_RSTC		(1 << 13)
/** HRTIM_TIMF_TIMFICR_RSTx2C Output 2 Reset flag Clear **/
#define HRTIM_TIMF_TIMFICR_RSTx2C		(1 << 12)
/** HRTIM_TIMF_TIMFICR_SET2xC Output 2 Set flag Clear **/
#define HRTIM_TIMF_TIMFICR_SET2xC		(1 << 11)
/** HRTIM_TIMF_TIMFICR_RSTx1C Output 1 Reset flag Clear **/
#define HRTIM_TIMF_TIMFICR_RSTx1C		(1 << 10)
/** HRTIM_TIMF_TIMFICR_SET1xC Output 1 Set flag Clear **/
#define HRTIM_TIMF_TIMFICR_SET1xC		(1 << 9)
/** HRTIM_TIMF_TIMFICR_CPT2C Capture2 Interrupt flag Clear **/
#define HRTIM_TIMF_TIMFICR_CPT2C		(1 << 8)
/** HRTIM_TIMF_TIMFICR_CPT1C Capture1 Interrupt flag Clear **/
#define HRTIM_TIMF_TIMFICR_CPT1C		(1 << 7)
/** HRTIM_TIMF_TIMFICR_UPDC Update Interrupt flag Clear **/
#define HRTIM_TIMF_TIMFICR_UPDC		(1 << 6)
/** HRTIM_TIMF_TIMFICR_REPC Repetition Interrupt flag Clear **/
#define HRTIM_TIMF_TIMFICR_REPC		(1 << 4)
/** HRTIM_TIMF_TIMFICR_CMP4C Compare 4 Interrupt flag Clear **/
#define HRTIM_TIMF_TIMFICR_CMP4C		(1 << 3)
/** HRTIM_TIMF_TIMFICR_CMP3C Compare 3 Interrupt flag Clear **/
#define HRTIM_TIMF_TIMFICR_CMP3C		(1 << 2)
/** HRTIM_TIMF_TIMFICR_CMP2C Compare 2 Interrupt flag Clear **/
#define HRTIM_TIMF_TIMFICR_CMP2C		(1 << 1)
/** HRTIM_TIMF_TIMFICR_CMP1C Compare 1 Interrupt flag Clear **/
#define HRTIM_TIMF_TIMFICR_CMP1C		(1 << 0)

/**@}*/

/** @defgroup hrtim_timf_timfdier TIMFDIER TIMxDIER
@{*/

