grevaillot/svd_tools/headers/STM32G474xx/hrtim_timf.h
/** HRTIM_TIMF_TIMFDIER_DLYPRTDE DLYPRTDE **/
#define HRTIM_TIMF_TIMFDIER_DLYPRTDE		(1 << 30)
/** HRTIM_TIMF_TIMFDIER_RSTDE RSTDE **/
#define HRTIM_TIMF_TIMFDIER_RSTDE		(1 << 29)
/** HRTIM_TIMF_TIMFDIER_RSTx2DE RSTx2DE **/
#define HRTIM_TIMF_TIMFDIER_RSTx2DE		(1 << 28)
/** HRTIM_TIMF_TIMFDIER_SETx2DE SETx2DE **/
#define HRTIM_TIMF_TIMFDIER_SETx2DE		(1 << 27)
/** HRTIM_TIMF_TIMFDIER_RSTx1DE RSTx1DE **/
#define HRTIM_TIMF_TIMFDIER_RSTx1DE		(1 << 26)
/** HRTIM_TIMF_TIMFDIER_SET1xDE SET1xDE **/
#define HRTIM_TIMF_TIMFDIER_SET1xDE		(1 << 25)
/** HRTIM_TIMF_TIMFDIER_CPT2DE CPT2DE **/
#define HRTIM_TIMF_TIMFDIER_CPT2DE		(1 << 24)
/** HRTIM_TIMF_TIMFDIER_CPT1DE CPT1DE **/
#define HRTIM_TIMF_TIMFDIER_CPT1DE		(1 << 23)
/** HRTIM_TIMF_TIMFDIER_UPDDE UPDDE **/
#define HRTIM_TIMF_TIMFDIER_UPDDE		(1 << 22)
/** HRTIM_TIMF_TIMFDIER_REPDE REPDE **/
#define HRTIM_TIMF_TIMFDIER_REPDE		(1 << 20)
/** HRTIM_TIMF_TIMFDIER_CMP4DE CMP4DE **/
#define HRTIM_TIMF_TIMFDIER_CMP4DE		(1 << 19)
/** HRTIM_TIMF_TIMFDIER_CMP3DE CMP3DE **/
#define HRTIM_TIMF_TIMFDIER_CMP3DE		(1 << 18)
/** HRTIM_TIMF_TIMFDIER_CMP2DE CMP2DE **/
#define HRTIM_TIMF_TIMFDIER_CMP2DE		(1 << 17)
/** HRTIM_TIMF_TIMFDIER_CMP1DE CMP1DE **/
#define HRTIM_TIMF_TIMFDIER_CMP1DE		(1 << 16)
/** HRTIM_TIMF_TIMFDIER_DLYPRTIE DLYPRTIE **/
#define HRTIM_TIMF_TIMFDIER_DLYPRTIE		(1 << 14)
/** HRTIM_TIMF_TIMFDIER_RSTIE RSTIE **/
#define HRTIM_TIMF_TIMFDIER_RSTIE		(1 << 13)
/** HRTIM_TIMF_TIMFDIER_RSTx2IE RSTx2IE **/
#define HRTIM_TIMF_TIMFDIER_RSTx2IE		(1 << 12)
/** HRTIM_TIMF_TIMFDIER_SETx2IE SETx2IE **/
#define HRTIM_TIMF_TIMFDIER_SETx2IE		(1 << 11)
/** HRTIM_TIMF_TIMFDIER_RSTx1IE RSTx1IE **/
#define HRTIM_TIMF_TIMFDIER_RSTx1IE		(1 << 10)
/** HRTIM_TIMF_TIMFDIER_SET1xIE SET1xIE **/
#define HRTIM_TIMF_TIMFDIER_SET1xIE		(1 << 9)
/** HRTIM_TIMF_TIMFDIER_CPT2IE CPT2IE **/
#define HRTIM_TIMF_TIMFDIER_CPT2IE		(1 << 8)
/** HRTIM_TIMF_TIMFDIER_CPT1IE CPT1IE **/
#define HRTIM_TIMF_TIMFDIER_CPT1IE		(1 << 7)
/** HRTIM_TIMF_TIMFDIER_UPDIE UPDIE **/
#define HRTIM_TIMF_TIMFDIER_UPDIE		(1 << 6)
/** HRTIM_TIMF_TIMFDIER_REPIE REPIE **/
#define HRTIM_TIMF_TIMFDIER_REPIE		(1 << 4)
/** HRTIM_TIMF_TIMFDIER_CMP4IE CMP4IE **/
#define HRTIM_TIMF_TIMFDIER_CMP4IE		(1 << 3)
/** HRTIM_TIMF_TIMFDIER_CMP3IE CMP3IE **/
#define HRTIM_TIMF_TIMFDIER_CMP3IE		(1 << 2)
/** HRTIM_TIMF_TIMFDIER_CMP2IE CMP2IE **/
#define HRTIM_TIMF_TIMFDIER_CMP2IE		(1 << 1)
/** HRTIM_TIMF_TIMFDIER_CMP1IE CMP1IE **/
#define HRTIM_TIMF_TIMFDIER_CMP1IE		(1 << 0)

/**@}*/

/** @defgroup hrtim_timf_cntfr CNTFR Timerx Counter Register
@{*/


#define HRTIM_TIMF_CNTFR_CNTx_SHIFT		0
#define HRTIM_TIMF_CNTFR_CNTx_MASK		0xffff
/** @defgroup hrtim_timf_cntfr_cntx CNTx Timerx Counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timf_perfr PERFR Timerx Period Register
@{*/


#define HRTIM_TIMF_PERFR_PERx_SHIFT		0
#define HRTIM_TIMF_PERFR_PERx_MASK		0xffff
/** @defgroup hrtim_timf_perfr_perx PERx Timerx Period value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timf_repfr REPFR Timerx Repetition Register
@{*/


#define HRTIM_TIMF_REPFR_REPx_SHIFT		0
#define HRTIM_TIMF_REPFR_REPx_MASK		0xff
/** @defgroup hrtim_timf_repfr_repx REPx Timerx Repetition counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timf_cmp1fr CMP1FR Timerx Compare 1 Register
@{*/


#define HRTIM_TIMF_CMP1FR_CMP1x_SHIFT		0
#define HRTIM_TIMF_CMP1FR_CMP1x_MASK		0xffff
/** @defgroup hrtim_timf_cmp1fr_cmp1x CMP1x Timerx Compare 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timf_cmp1cfr CMP1CFR Timerx Compare 1 Compound Register
@{*/


#define HRTIM_TIMF_CMP1CFR_REPx_SHIFT		16
#define HRTIM_TIMF_CMP1CFR_REPx_MASK		0xff
/** @defgroup hrtim_timf_cmp1cfr_repx REPx Timerx Repetition value (aliased from HRTIM_REPx register)
@{*/
/**@}*/


#define HRTIM_TIMF_CMP1CFR_CMP1x_SHIFT		0
#define HRTIM_TIMF_CMP1CFR_CMP1x_MASK		0xffff
/** @defgroup hrtim_timf_cmp1cfr_cmp1x CMP1x Timerx Compare 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timf_cmp2fr CMP2FR Timerx Compare 2 Register
@{*/


#define HRTIM_TIMF_CMP2FR_CMP2x_SHIFT		0
#define HRTIM_TIMF_CMP2FR_CMP2x_MASK		0xffff
/** @defgroup hrtim_timf_cmp2fr_cmp2x CMP2x Timerx Compare 2 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timf_cmp3fr CMP3FR Timerx Compare 3 Register
@{*/


#define HRTIM_TIMF_CMP3FR_CMP3x_SHIFT		0
#define HRTIM_TIMF_CMP3FR_CMP3x_MASK		0xffff
/** @defgroup hrtim_timf_cmp3fr_cmp3x CMP3x Timerx Compare 3 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timf_cmp4fr CMP4FR Timerx Compare 4 Register
@{*/


#define HRTIM_TIMF_CMP4FR_CMP4x_SHIFT		0
#define HRTIM_TIMF_CMP4FR_CMP4x_MASK		0xffff
/** @defgroup hrtim_timf_cmp4fr_cmp4x CMP4x Timerx Compare 4 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timf_cpt1fr CPT1FR Timerx Capture 1 Register
@{*/

/** HRTIM_TIMF_CPT1FR_DIR Timerx Capture 1 Direction status **/
#define HRTIM_TIMF_CPT1FR_DIR		(1 << 16)

#define HRTIM_TIMF_CPT1FR_CPT1x_SHIFT		0
#define HRTIM_TIMF_CPT1FR_CPT1x_MASK		0xffff
/** @defgroup hrtim_timf_cpt1fr_cpt1x CPT1x Timerx Capture 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timf_cpt2fr CPT2FR Timerx Capture 2 Register
@{*/

/** HRTIM_TIMF_CPT2FR_DIR Timerx Capture 1 Direction status **/
#define HRTIM_TIMF_CPT2FR_DIR		(1 << 16)

#define HRTIM_TIMF_CPT2FR_CPT2x_SHIFT		0
#define HRTIM_TIMF_CPT2FR_CPT2x_MASK		0xffff
/** @defgroup hrtim_timf_cpt2fr_cpt2x CPT2x Timerx Capture 2 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timf_dtfr DTFR Timerx Deadtime Register
@{*/

/** HRTIM_TIMF_DTFR_DTFLKx Deadtime Falling Lock **/
#define HRTIM_TIMF_DTFR_DTFLKx		(1 << 31)
/** HRTIM_TIMF_DTFR_DTFSLKx Deadtime Falling Sign Lock **/
#define HRTIM_TIMF_DTFR_DTFSLKx		(1 << 30)
/** HRTIM_TIMF_DTFR_SDTFx Sign Deadtime Falling value **/
#define HRTIM_TIMF_DTFR_SDTFx		(1 << 25)

#define HRTIM_TIMF_DTFR_DTFx_SHIFT		16
#define HRTIM_TIMF_DTFR_DTFx_MASK		0x1ff
/** @defgroup hrtim_timf_dtfr_dtfx DTFx Deadtime Falling value
@{*/
/**@}*/

/** HRTIM_TIMF_DTFR_DTRLKx Deadtime Rising Lock **/
#define HRTIM_TIMF_DTFR_DTRLKx		(1 << 15)
/** HRTIM_TIMF_DTFR_DTRSLKx Deadtime Rising Sign Lock **/
#define HRTIM_TIMF_DTFR_DTRSLKx		(1 << 14)

#define HRTIM_TIMF_DTFR_DTPRSC_SHIFT		10
#define HRTIM_TIMF_DTFR_DTPRSC_MASK		0x07
/** @defgroup hrtim_timf_dtfr_dtprsc DTPRSC Deadtime Prescaler
@{*/
/**@}*/

/** HRTIM_TIMF_DTFR_SDTRx Sign Deadtime Rising value **/
#define HRTIM_TIMF_DTFR_SDTRx		(1 << 9)

#define HRTIM_TIMF_DTFR_DTRx_SHIFT		0
#define HRTIM_TIMF_DTFR_DTRx_MASK		0x1ff
/** @defgroup hrtim_timf_dtfr_dtrx DTRx Deadtime Rising value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timf_setf1r SETF1R Timerx Output1 Set Register
@{*/

