grevaillot/svd_tools/headers/STM32G474xx/hrtim_timf.h
/** HRTIM_TIMF_SETF1R_UPDATE Registers update (transfer preload to active) **/
#define HRTIM_TIMF_SETF1R_UPDATE		(1 << 31)
/** HRTIM_TIMF_SETF1R_EXTEVNT10 External Event 10 **/
#define HRTIM_TIMF_SETF1R_EXTEVNT10		(1 << 30)
/** HRTIM_TIMF_SETF1R_EXTEVNT9 External Event 9 **/
#define HRTIM_TIMF_SETF1R_EXTEVNT9		(1 << 29)
/** HRTIM_TIMF_SETF1R_EXTEVNT8 External Event 8 **/
#define HRTIM_TIMF_SETF1R_EXTEVNT8		(1 << 28)
/** HRTIM_TIMF_SETF1R_EXTEVNT7 External Event 7 **/
#define HRTIM_TIMF_SETF1R_EXTEVNT7		(1 << 27)
/** HRTIM_TIMF_SETF1R_EXTEVNT6 External Event 6 **/
#define HRTIM_TIMF_SETF1R_EXTEVNT6		(1 << 26)
/** HRTIM_TIMF_SETF1R_EXTEVNT5 External Event 5 **/
#define HRTIM_TIMF_SETF1R_EXTEVNT5		(1 << 25)
/** HRTIM_TIMF_SETF1R_EXTEVNT4 External Event 4 **/
#define HRTIM_TIMF_SETF1R_EXTEVNT4		(1 << 24)
/** HRTIM_TIMF_SETF1R_EXTEVNT3 External Event 3 **/
#define HRTIM_TIMF_SETF1R_EXTEVNT3		(1 << 23)
/** HRTIM_TIMF_SETF1R_EXTEVNT2 External Event 2 **/
#define HRTIM_TIMF_SETF1R_EXTEVNT2		(1 << 22)
/** HRTIM_TIMF_SETF1R_EXTEVNT1 External Event 1 **/
#define HRTIM_TIMF_SETF1R_EXTEVNT1		(1 << 21)
/** HRTIM_TIMF_SETF1R_TIMEVNT9 Timer Event 9 **/
#define HRTIM_TIMF_SETF1R_TIMEVNT9		(1 << 20)
/** HRTIM_TIMF_SETF1R_TIMEVNT8 Timer Event 8 **/
#define HRTIM_TIMF_SETF1R_TIMEVNT8		(1 << 19)
/** HRTIM_TIMF_SETF1R_TIMEVNT7 Timer Event 7 **/
#define HRTIM_TIMF_SETF1R_TIMEVNT7		(1 << 18)
/** HRTIM_TIMF_SETF1R_TIMEVNT6 Timer Event 6 **/
#define HRTIM_TIMF_SETF1R_TIMEVNT6		(1 << 17)
/** HRTIM_TIMF_SETF1R_TIMEVNT5 Timer Event 5 **/
#define HRTIM_TIMF_SETF1R_TIMEVNT5		(1 << 16)
/** HRTIM_TIMF_SETF1R_TIMEVNT4 Timer Event 4 **/
#define HRTIM_TIMF_SETF1R_TIMEVNT4		(1 << 15)
/** HRTIM_TIMF_SETF1R_TIMEVNT3 Timer Event 3 **/
#define HRTIM_TIMF_SETF1R_TIMEVNT3		(1 << 14)
/** HRTIM_TIMF_SETF1R_TIMEVNT2 Timer Event 2 **/
#define HRTIM_TIMF_SETF1R_TIMEVNT2		(1 << 13)
/** HRTIM_TIMF_SETF1R_TIMEVNT1 Timer Event 1 **/
#define HRTIM_TIMF_SETF1R_TIMEVNT1		(1 << 12)
/** HRTIM_TIMF_SETF1R_MSTCMP4 Master Compare 4 **/
#define HRTIM_TIMF_SETF1R_MSTCMP4		(1 << 11)
/** HRTIM_TIMF_SETF1R_MSTCMP3 Master Compare 3 **/
#define HRTIM_TIMF_SETF1R_MSTCMP3		(1 << 10)
/** HRTIM_TIMF_SETF1R_MSTCMP2 Master Compare 2 **/
#define HRTIM_TIMF_SETF1R_MSTCMP2		(1 << 9)
/** HRTIM_TIMF_SETF1R_MSTCMP1 Master Compare 1 **/
#define HRTIM_TIMF_SETF1R_MSTCMP1		(1 << 8)
/** HRTIM_TIMF_SETF1R_MSTPER Master Period **/
#define HRTIM_TIMF_SETF1R_MSTPER		(1 << 7)
/** HRTIM_TIMF_SETF1R_CMP4 Timer A compare 4 **/
#define HRTIM_TIMF_SETF1R_CMP4		(1 << 6)
/** HRTIM_TIMF_SETF1R_CMP3 Timer A compare 3 **/
#define HRTIM_TIMF_SETF1R_CMP3		(1 << 5)
/** HRTIM_TIMF_SETF1R_CMP2 Timer A compare 2 **/
#define HRTIM_TIMF_SETF1R_CMP2		(1 << 4)
/** HRTIM_TIMF_SETF1R_CMP1 Timer A compare 1 **/
#define HRTIM_TIMF_SETF1R_CMP1		(1 << 3)
/** HRTIM_TIMF_SETF1R_PER Timer A Period **/
#define HRTIM_TIMF_SETF1R_PER		(1 << 2)
/** HRTIM_TIMF_SETF1R_RESYNC Timer A resynchronizaton **/
#define HRTIM_TIMF_SETF1R_RESYNC		(1 << 1)
/** HRTIM_TIMF_SETF1R_SST Software Set trigger **/
#define HRTIM_TIMF_SETF1R_SST		(1 << 0)

/**@}*/

/** @defgroup hrtim_timf_rste1r RSTE1R Timerx Output1 Reset Register
@{*/

/** HRTIM_TIMF_RSTE1R_UPDATE UPDATE **/
#define HRTIM_TIMF_RSTE1R_UPDATE		(1 << 31)
/** HRTIM_TIMF_RSTE1R_EXTEVNT10 EXTEVNT10 **/
#define HRTIM_TIMF_RSTE1R_EXTEVNT10		(1 << 30)
/** HRTIM_TIMF_RSTE1R_EXTEVNT9 EXTEVNT9 **/
#define HRTIM_TIMF_RSTE1R_EXTEVNT9		(1 << 29)
/** HRTIM_TIMF_RSTE1R_EXTEVNT8 EXTEVNT8 **/
#define HRTIM_TIMF_RSTE1R_EXTEVNT8		(1 << 28)
/** HRTIM_TIMF_RSTE1R_EXTEVNT7 EXTEVNT7 **/
#define HRTIM_TIMF_RSTE1R_EXTEVNT7		(1 << 27)
/** HRTIM_TIMF_RSTE1R_EXTEVNT6 EXTEVNT6 **/
#define HRTIM_TIMF_RSTE1R_EXTEVNT6		(1 << 26)
/** HRTIM_TIMF_RSTE1R_EXTEVNT5 EXTEVNT5 **/
#define HRTIM_TIMF_RSTE1R_EXTEVNT5		(1 << 25)
/** HRTIM_TIMF_RSTE1R_EXTEVNT4 EXTEVNT4 **/
#define HRTIM_TIMF_RSTE1R_EXTEVNT4		(1 << 24)
/** HRTIM_TIMF_RSTE1R_EXTEVNT3 EXTEVNT3 **/
#define HRTIM_TIMF_RSTE1R_EXTEVNT3		(1 << 23)
/** HRTIM_TIMF_RSTE1R_EXTEVNT2 EXTEVNT2 **/
#define HRTIM_TIMF_RSTE1R_EXTEVNT2		(1 << 22)
/** HRTIM_TIMF_RSTE1R_EXTEVNT1 EXTEVNT1 **/
#define HRTIM_TIMF_RSTE1R_EXTEVNT1		(1 << 21)
/** HRTIM_TIMF_RSTE1R_TIMEVNT9 TIMEVNT9 **/
#define HRTIM_TIMF_RSTE1R_TIMEVNT9		(1 << 20)
/** HRTIM_TIMF_RSTE1R_TIMEVNT8 TIMEVNT8 **/
#define HRTIM_TIMF_RSTE1R_TIMEVNT8		(1 << 19)
/** HRTIM_TIMF_RSTE1R_TIMEVNT7 TIMEVNT7 **/
#define HRTIM_TIMF_RSTE1R_TIMEVNT7		(1 << 18)
/** HRTIM_TIMF_RSTE1R_TIMEVNT6 TIMEVNT6 **/
#define HRTIM_TIMF_RSTE1R_TIMEVNT6		(1 << 17)
/** HRTIM_TIMF_RSTE1R_TIMEVNT5 TIMEVNT5 **/
#define HRTIM_TIMF_RSTE1R_TIMEVNT5		(1 << 16)
/** HRTIM_TIMF_RSTE1R_TIMEVNT4 TIMEVNT4 **/
#define HRTIM_TIMF_RSTE1R_TIMEVNT4		(1 << 15)
/** HRTIM_TIMF_RSTE1R_TIMEVNT3 TIMEVNT3 **/
#define HRTIM_TIMF_RSTE1R_TIMEVNT3		(1 << 14)
/** HRTIM_TIMF_RSTE1R_TIMEVNT2 TIMEVNT2 **/
#define HRTIM_TIMF_RSTE1R_TIMEVNT2		(1 << 13)
/** HRTIM_TIMF_RSTE1R_TIMEVNT1 TIMEVNT1 **/
#define HRTIM_TIMF_RSTE1R_TIMEVNT1		(1 << 12)
/** HRTIM_TIMF_RSTE1R_MSTCMP4 MSTCMP4 **/
#define HRTIM_TIMF_RSTE1R_MSTCMP4		(1 << 11)
/** HRTIM_TIMF_RSTE1R_MSTCMP3 MSTCMP3 **/
#define HRTIM_TIMF_RSTE1R_MSTCMP3		(1 << 10)
/** HRTIM_TIMF_RSTE1R_MSTCMP2 MSTCMP2 **/
#define HRTIM_TIMF_RSTE1R_MSTCMP2		(1 << 9)
/** HRTIM_TIMF_RSTE1R_MSTCMP1 MSTCMP1 **/
#define HRTIM_TIMF_RSTE1R_MSTCMP1		(1 << 8)
/** HRTIM_TIMF_RSTE1R_MSTPER MSTPER **/
#define HRTIM_TIMF_RSTE1R_MSTPER		(1 << 7)
/** HRTIM_TIMF_RSTE1R_CMP4 CMP4 **/
#define HRTIM_TIMF_RSTE1R_CMP4		(1 << 6)
/** HRTIM_TIMF_RSTE1R_CMP3 CMP3 **/
#define HRTIM_TIMF_RSTE1R_CMP3		(1 << 5)
/** HRTIM_TIMF_RSTE1R_CMP2 CMP2 **/
#define HRTIM_TIMF_RSTE1R_CMP2		(1 << 4)
/** HRTIM_TIMF_RSTE1R_CMP1 CMP1 **/
#define HRTIM_TIMF_RSTE1R_CMP1		(1 << 3)
/** HRTIM_TIMF_RSTE1R_PER PER **/
#define HRTIM_TIMF_RSTE1R_PER		(1 << 2)
/** HRTIM_TIMF_RSTE1R_RESYNC RESYNC **/
#define HRTIM_TIMF_RSTE1R_RESYNC		(1 << 1)
/** HRTIM_TIMF_RSTE1R_SRT SRT **/
#define HRTIM_TIMF_RSTE1R_SRT		(1 << 0)

/**@}*/

/** @defgroup hrtim_timf_setf2r SETF2R Timerx Output2 Set Register
@{*/

/** HRTIM_TIMF_SETF2R_UPDATE UPDATE **/
#define HRTIM_TIMF_SETF2R_UPDATE		(1 << 31)
/** HRTIM_TIMF_SETF2R_EXTEVNT10 EXTEVNT10 **/
#define HRTIM_TIMF_SETF2R_EXTEVNT10		(1 << 30)
/** HRTIM_TIMF_SETF2R_EXTEVNT9 EXTEVNT9 **/
#define HRTIM_TIMF_SETF2R_EXTEVNT9		(1 << 29)
/** HRTIM_TIMF_SETF2R_EXTEVNT8 EXTEVNT8 **/
#define HRTIM_TIMF_SETF2R_EXTEVNT8		(1 << 28)
/** HRTIM_TIMF_SETF2R_EXTEVNT7 EXTEVNT7 **/
#define HRTIM_TIMF_SETF2R_EXTEVNT7		(1 << 27)
/** HRTIM_TIMF_SETF2R_EXTEVNT6 EXTEVNT6 **/
#define HRTIM_TIMF_SETF2R_EXTEVNT6		(1 << 26)
/** HRTIM_TIMF_SETF2R_EXTEVNT5 EXTEVNT5 **/
#define HRTIM_TIMF_SETF2R_EXTEVNT5		(1 << 25)
/** HRTIM_TIMF_SETF2R_EXTEVNT4 EXTEVNT4 **/
#define HRTIM_TIMF_SETF2R_EXTEVNT4		(1 << 24)
/** HRTIM_TIMF_SETF2R_EXTEVNT3 EXTEVNT3 **/
#define HRTIM_TIMF_SETF2R_EXTEVNT3		(1 << 23)
/** HRTIM_TIMF_SETF2R_EXTEVNT2 EXTEVNT2 **/
#define HRTIM_TIMF_SETF2R_EXTEVNT2		(1 << 22)
/** HRTIM_TIMF_SETF2R_EXTEVNT1 EXTEVNT1 **/
#define HRTIM_TIMF_SETF2R_EXTEVNT1		(1 << 21)
/** HRTIM_TIMF_SETF2R_TIMEVNT9 TIMEVNT9 **/
#define HRTIM_TIMF_SETF2R_TIMEVNT9		(1 << 20)
/** HRTIM_TIMF_SETF2R_TIMEVNT8 TIMEVNT8 **/
#define HRTIM_TIMF_SETF2R_TIMEVNT8		(1 << 19)
/** HRTIM_TIMF_SETF2R_TIMEVNT7 TIMEVNT7 **/
#define HRTIM_TIMF_SETF2R_TIMEVNT7		(1 << 18)
/** HRTIM_TIMF_SETF2R_TIMEVNT6 TIMEVNT6 **/
#define HRTIM_TIMF_SETF2R_TIMEVNT6		(1 << 17)
/** HRTIM_TIMF_SETF2R_TIMEVNT5 TIMEVNT5 **/
#define HRTIM_TIMF_SETF2R_TIMEVNT5		(1 << 16)
/** HRTIM_TIMF_SETF2R_TIMEVNT4 TIMEVNT4 **/
#define HRTIM_TIMF_SETF2R_TIMEVNT4		(1 << 15)
/** HRTIM_TIMF_SETF2R_TIMEVNT3 TIMEVNT3 **/
#define HRTIM_TIMF_SETF2R_TIMEVNT3		(1 << 14)
/** HRTIM_TIMF_SETF2R_TIMEVNT2 TIMEVNT2 **/
#define HRTIM_TIMF_SETF2R_TIMEVNT2		(1 << 13)
/** HRTIM_TIMF_SETF2R_TIMEVNT1 TIMEVNT1 **/
#define HRTIM_TIMF_SETF2R_TIMEVNT1		(1 << 12)
/** HRTIM_TIMF_SETF2R_MSTCMP4 MSTCMP4 **/
#define HRTIM_TIMF_SETF2R_MSTCMP4		(1 << 11)
/** HRTIM_TIMF_SETF2R_MSTCMP3 MSTCMP3 **/
#define HRTIM_TIMF_SETF2R_MSTCMP3		(1 << 10)
/** HRTIM_TIMF_SETF2R_MSTCMP2 MSTCMP2 **/
#define HRTIM_TIMF_SETF2R_MSTCMP2		(1 << 9)
/** HRTIM_TIMF_SETF2R_MSTCMP1 MSTCMP1 **/
#define HRTIM_TIMF_SETF2R_MSTCMP1		(1 << 8)
/** HRTIM_TIMF_SETF2R_MSTPER MSTPER **/
#define HRTIM_TIMF_SETF2R_MSTPER		(1 << 7)
/** HRTIM_TIMF_SETF2R_CMP4 CMP4 **/
#define HRTIM_TIMF_SETF2R_CMP4		(1 << 6)
/** HRTIM_TIMF_SETF2R_CMP3 CMP3 **/
#define HRTIM_TIMF_SETF2R_CMP3		(1 << 5)
/** HRTIM_TIMF_SETF2R_CMP2 CMP2 **/
#define HRTIM_TIMF_SETF2R_CMP2		(1 << 4)
/** HRTIM_TIMF_SETF2R_CMP1 CMP1 **/
#define HRTIM_TIMF_SETF2R_CMP1		(1 << 3)
/** HRTIM_TIMF_SETF2R_PER PER **/
#define HRTIM_TIMF_SETF2R_PER		(1 << 2)
/** HRTIM_TIMF_SETF2R_RESYNC RESYNC **/
#define HRTIM_TIMF_SETF2R_RESYNC		(1 << 1)
/** HRTIM_TIMF_SETF2R_SST SST **/
#define HRTIM_TIMF_SETF2R_SST		(1 << 0)

/**@}*/

/** @defgroup hrtim_timf_rstf2r RSTF2R Timerx Output2 Reset Register
@{*/

/** HRTIM_TIMF_RSTF2R_UPDATE UPDATE **/
#define HRTIM_TIMF_RSTF2R_UPDATE		(1 << 31)
/** HRTIM_TIMF_RSTF2R_EXTEVNT10 EXTEVNT10 **/
#define HRTIM_TIMF_RSTF2R_EXTEVNT10		(1 << 30)
/** HRTIM_TIMF_RSTF2R_EXTEVNT9 EXTEVNT9 **/
#define HRTIM_TIMF_RSTF2R_EXTEVNT9		(1 << 29)
/** HRTIM_TIMF_RSTF2R_EXTEVNT8 EXTEVNT8 **/
#define HRTIM_TIMF_RSTF2R_EXTEVNT8		(1 << 28)
/** HRTIM_TIMF_RSTF2R_EXTEVNT7 EXTEVNT7 **/
#define HRTIM_TIMF_RSTF2R_EXTEVNT7		(1 << 27)
/** HRTIM_TIMF_RSTF2R_EXTEVNT6 EXTEVNT6 **/
#define HRTIM_TIMF_RSTF2R_EXTEVNT6		(1 << 26)
/** HRTIM_TIMF_RSTF2R_EXTEVNT5 EXTEVNT5 **/
#define HRTIM_TIMF_RSTF2R_EXTEVNT5		(1 << 25)
/** HRTIM_TIMF_RSTF2R_EXTEVNT4 EXTEVNT4 **/
#define HRTIM_TIMF_RSTF2R_EXTEVNT4		(1 << 24)
/** HRTIM_TIMF_RSTF2R_EXTEVNT3 EXTEVNT3 **/
#define HRTIM_TIMF_RSTF2R_EXTEVNT3		(1 << 23)
/** HRTIM_TIMF_RSTF2R_EXTEVNT2 EXTEVNT2 **/
#define HRTIM_TIMF_RSTF2R_EXTEVNT2		(1 << 22)
/** HRTIM_TIMF_RSTF2R_EXTEVNT1 EXTEVNT1 **/
#define HRTIM_TIMF_RSTF2R_EXTEVNT1		(1 << 21)
/** HRTIM_TIMF_RSTF2R_TIMEVNT9 TIMEVNT9 **/
#define HRTIM_TIMF_RSTF2R_TIMEVNT9		(1 << 20)
/** HRTIM_TIMF_RSTF2R_TIMEVNT8 TIMEVNT8 **/
#define HRTIM_TIMF_RSTF2R_TIMEVNT8		(1 << 19)
/** HRTIM_TIMF_RSTF2R_TIMEVNT7 TIMEVNT7 **/
#define HRTIM_TIMF_RSTF2R_TIMEVNT7		(1 << 18)
/** HRTIM_TIMF_RSTF2R_TIMEVNT6 TIMEVNT6 **/
#define HRTIM_TIMF_RSTF2R_TIMEVNT6		(1 << 17)
/** HRTIM_TIMF_RSTF2R_TIMEVNT5 TIMEVNT5 **/
#define HRTIM_TIMF_RSTF2R_TIMEVNT5		(1 << 16)
/** HRTIM_TIMF_RSTF2R_TIMEVNT4 TIMEVNT4 **/
#define HRTIM_TIMF_RSTF2R_TIMEVNT4		(1 << 15)
/** HRTIM_TIMF_RSTF2R_TIMEVNT3 TIMEVNT3 **/
#define HRTIM_TIMF_RSTF2R_TIMEVNT3		(1 << 14)
/** HRTIM_TIMF_RSTF2R_TIMEVNT2 TIMEVNT2 **/
#define HRTIM_TIMF_RSTF2R_TIMEVNT2		(1 << 13)
/** HRTIM_TIMF_RSTF2R_TIMEVNT1 TIMEVNT1 **/
#define HRTIM_TIMF_RSTF2R_TIMEVNT1		(1 << 12)
/** HRTIM_TIMF_RSTF2R_MSTCMP4 MSTCMP4 **/
#define HRTIM_TIMF_RSTF2R_MSTCMP4		(1 << 11)
/** HRTIM_TIMF_RSTF2R_MSTCMP3 MSTCMP3 **/
#define HRTIM_TIMF_RSTF2R_MSTCMP3		(1 << 10)
/** HRTIM_TIMF_RSTF2R_MSTCMP2 MSTCMP2 **/
#define HRTIM_TIMF_RSTF2R_MSTCMP2		(1 << 9)
/** HRTIM_TIMF_RSTF2R_MSTCMP1 MSTCMP1 **/
#define HRTIM_TIMF_RSTF2R_MSTCMP1		(1 << 8)
/** HRTIM_TIMF_RSTF2R_MSTPER MSTPER **/
#define HRTIM_TIMF_RSTF2R_MSTPER		(1 << 7)
/** HRTIM_TIMF_RSTF2R_CMP4 CMP4 **/
#define HRTIM_TIMF_RSTF2R_CMP4		(1 << 6)
/** HRTIM_TIMF_RSTF2R_CMP3 CMP3 **/
#define HRTIM_TIMF_RSTF2R_CMP3		(1 << 5)
/** HRTIM_TIMF_RSTF2R_CMP2 CMP2 **/
#define HRTIM_TIMF_RSTF2R_CMP2		(1 << 4)
/** HRTIM_TIMF_RSTF2R_CMP1 CMP1 **/
#define HRTIM_TIMF_RSTF2R_CMP1		(1 << 3)
/** HRTIM_TIMF_RSTF2R_PER PER **/
#define HRTIM_TIMF_RSTF2R_PER		(1 << 2)
/** HRTIM_TIMF_RSTF2R_RESYNC RESYNC **/
#define HRTIM_TIMF_RSTF2R_RESYNC		(1 << 1)
/** HRTIM_TIMF_RSTF2R_SRT SRT **/
#define HRTIM_TIMF_RSTF2R_SRT		(1 << 0)

/**@}*/

/** @defgroup hrtim_timf_eeffr1 EEFFR1 Timerx External Event Filtering Register 1
@{*/


#define HRTIM_TIMF_EEFFR1_EE5FLTR_SHIFT		25
#define HRTIM_TIMF_EEFFR1_EE5FLTR_MASK		0x0f
/** @defgroup hrtim_timf_eeffr1_ee5fltr EE5FLTR External Event 5 filter
@{*/
/**@}*/

/** HRTIM_TIMF_EEFFR1_EE5LTCH External Event 5 latch **/
#define HRTIM_TIMF_EEFFR1_EE5LTCH		(1 << 24)

#define HRTIM_TIMF_EEFFR1_EE4FLTR_SHIFT		19
#define HRTIM_TIMF_EEFFR1_EE4FLTR_MASK		0x0f
/** @defgroup hrtim_timf_eeffr1_ee4fltr EE4FLTR External Event 4 filter
@{*/
/**@}*/

/** HRTIM_TIMF_EEFFR1_EE4LTCH External Event 4 latch **/
#define HRTIM_TIMF_EEFFR1_EE4LTCH		(1 << 18)

#define HRTIM_TIMF_EEFFR1_EE3FLTR_SHIFT		13
#define HRTIM_TIMF_EEFFR1_EE3FLTR_MASK		0x0f
/** @defgroup hrtim_timf_eeffr1_ee3fltr EE3FLTR External Event 3 filter
@{*/
/**@}*/

/** HRTIM_TIMF_EEFFR1_EE3LTCH External Event 3 latch **/
#define HRTIM_TIMF_EEFFR1_EE3LTCH		(1 << 12)

#define HRTIM_TIMF_EEFFR1_EE2FLTR_SHIFT		7
#define HRTIM_TIMF_EEFFR1_EE2FLTR_MASK		0x0f
/** @defgroup hrtim_timf_eeffr1_ee2fltr EE2FLTR External Event 2 filter
@{*/
/**@}*/

/** HRTIM_TIMF_EEFFR1_EE2LTCH External Event 2 latch **/
#define HRTIM_TIMF_EEFFR1_EE2LTCH		(1 << 6)

#define HRTIM_TIMF_EEFFR1_EE1FLTR_SHIFT		1
#define HRTIM_TIMF_EEFFR1_EE1FLTR_MASK		0x0f
/** @defgroup hrtim_timf_eeffr1_ee1fltr EE1FLTR External Event 1 filter
@{*/
/**@}*/

/** HRTIM_TIMF_EEFFR1_EE1LTCH External Event 1 latch **/
#define HRTIM_TIMF_EEFFR1_EE1LTCH		(1 << 0)

/**@}*/

/** @defgroup hrtim_timf_eeffr2 EEFFR2 Timerx External Event Filtering Register 2
@{*/


