grevaillot/svd_tools/headers/STM32G474xx/hrtim_timf.h
#define HRTIM_TIMF_EEFFR2_EE10FLTR_SHIFT		25
#define HRTIM_TIMF_EEFFR2_EE10FLTR_MASK		0x0f
/** @defgroup hrtim_timf_eeffr2_ee10fltr EE10FLTR External Event 10 filter
@{*/
/**@}*/

/** HRTIM_TIMF_EEFFR2_EE10LTCH External Event 10 latch **/
#define HRTIM_TIMF_EEFFR2_EE10LTCH		(1 << 24)

#define HRTIM_TIMF_EEFFR2_EE9FLTR_SHIFT		19
#define HRTIM_TIMF_EEFFR2_EE9FLTR_MASK		0x0f
/** @defgroup hrtim_timf_eeffr2_ee9fltr EE9FLTR External Event 9 filter
@{*/
/**@}*/

/** HRTIM_TIMF_EEFFR2_EE9LTCH External Event 9 latch **/
#define HRTIM_TIMF_EEFFR2_EE9LTCH		(1 << 18)

#define HRTIM_TIMF_EEFFR2_EE8FLTR_SHIFT		13
#define HRTIM_TIMF_EEFFR2_EE8FLTR_MASK		0x0f
/** @defgroup hrtim_timf_eeffr2_ee8fltr EE8FLTR External Event 8 filter
@{*/
/**@}*/

/** HRTIM_TIMF_EEFFR2_EE8LTCH External Event 8 latch **/
#define HRTIM_TIMF_EEFFR2_EE8LTCH		(1 << 12)

#define HRTIM_TIMF_EEFFR2_EE7FLTR_SHIFT		7
#define HRTIM_TIMF_EEFFR2_EE7FLTR_MASK		0x0f
/** @defgroup hrtim_timf_eeffr2_ee7fltr EE7FLTR External Event 7 filter
@{*/
/**@}*/

/** HRTIM_TIMF_EEFFR2_EE7LTCH External Event 7 latch **/
#define HRTIM_TIMF_EEFFR2_EE7LTCH		(1 << 6)

#define HRTIM_TIMF_EEFFR2_EE6FLTR_SHIFT		1
#define HRTIM_TIMF_EEFFR2_EE6FLTR_MASK		0x0f
/** @defgroup hrtim_timf_eeffr2_ee6fltr EE6FLTR External Event 6 filter
@{*/
/**@}*/

/** HRTIM_TIMF_EEFFR2_EE6LTCH External Event 6 latch **/
#define HRTIM_TIMF_EEFFR2_EE6LTCH		(1 << 0)

/**@}*/

/** @defgroup hrtim_timf_rstfr RSTFR TimerA Reset Register
@{*/

/** HRTIM_TIMF_RSTFR_TIMFCPM2 Timer F Compare 2 **/
#define HRTIM_TIMF_RSTFR_TIMFCPM2		(1 << 31)
/** HRTIM_TIMF_RSTFR_TIMDCMP4 Timer D Compare 4 **/
#define HRTIM_TIMF_RSTFR_TIMDCMP4		(1 << 30)
/** HRTIM_TIMF_RSTFR_TIMDCMP2 Timer D Compare 2 **/
#define HRTIM_TIMF_RSTFR_TIMDCMP2		(1 << 29)
/** HRTIM_TIMF_RSTFR_TIMDCMP1 Timer D Compare 1 **/
#define HRTIM_TIMF_RSTFR_TIMDCMP1		(1 << 28)
/** HRTIM_TIMF_RSTFR_TIMCCMP4 Timer C Compare 4 **/
#define HRTIM_TIMF_RSTFR_TIMCCMP4		(1 << 27)
/** HRTIM_TIMF_RSTFR_TIMCCMP2 Timer C Compare 2 **/
#define HRTIM_TIMF_RSTFR_TIMCCMP2		(1 << 26)
/** HRTIM_TIMF_RSTFR_TIMCCMP1 Timer C Compare 1 **/
#define HRTIM_TIMF_RSTFR_TIMCCMP1		(1 << 25)
/** HRTIM_TIMF_RSTFR_TIMBCMP4 Timer B Compare 4 **/
#define HRTIM_TIMF_RSTFR_TIMBCMP4		(1 << 24)
/** HRTIM_TIMF_RSTFR_TIMBCMP2 Timer B Compare 2 **/
#define HRTIM_TIMF_RSTFR_TIMBCMP2		(1 << 23)
/** HRTIM_TIMF_RSTFR_TIMBCMP1 Timer B Compare 1 **/
#define HRTIM_TIMF_RSTFR_TIMBCMP1		(1 << 22)
/** HRTIM_TIMF_RSTFR_TIMACMP4 Timer A Compare 4 **/
#define HRTIM_TIMF_RSTFR_TIMACMP4		(1 << 21)
/** HRTIM_TIMF_RSTFR_TIMACMP2 Timer A Compare 2 **/
#define HRTIM_TIMF_RSTFR_TIMACMP2		(1 << 20)
/** HRTIM_TIMF_RSTFR_TIMACMP1 Timer A Compare 1 **/
#define HRTIM_TIMF_RSTFR_TIMACMP1		(1 << 19)
/** HRTIM_TIMF_RSTFR_EXTEVNT10 External Event 10 **/
#define HRTIM_TIMF_RSTFR_EXTEVNT10		(1 << 18)
/** HRTIM_TIMF_RSTFR_EXTEVNT9 External Event 9 **/
#define HRTIM_TIMF_RSTFR_EXTEVNT9		(1 << 17)
/** HRTIM_TIMF_RSTFR_EXTEVNT8 External Event 8 **/
#define HRTIM_TIMF_RSTFR_EXTEVNT8		(1 << 16)
/** HRTIM_TIMF_RSTFR_EXTEVNT7 External Event 7 **/
#define HRTIM_TIMF_RSTFR_EXTEVNT7		(1 << 15)
/** HRTIM_TIMF_RSTFR_EXTEVNT6 External Event 6 **/
#define HRTIM_TIMF_RSTFR_EXTEVNT6		(1 << 14)
/** HRTIM_TIMF_RSTFR_EXTEVNT5 External Event 5 **/
#define HRTIM_TIMF_RSTFR_EXTEVNT5		(1 << 13)
/** HRTIM_TIMF_RSTFR_EXTEVNT4 External Event 4 **/
#define HRTIM_TIMF_RSTFR_EXTEVNT4		(1 << 12)
/** HRTIM_TIMF_RSTFR_EXTEVNT3 External Event 3 **/
#define HRTIM_TIMF_RSTFR_EXTEVNT3		(1 << 11)
/** HRTIM_TIMF_RSTFR_EXTEVNT2 External Event 2 **/
#define HRTIM_TIMF_RSTFR_EXTEVNT2		(1 << 10)
/** HRTIM_TIMF_RSTFR_EXTEVNT1 External Event 1 **/
#define HRTIM_TIMF_RSTFR_EXTEVNT1		(1 << 9)
/** HRTIM_TIMF_RSTFR_MSTCMP4 Master compare 4 **/
#define HRTIM_TIMF_RSTFR_MSTCMP4		(1 << 8)
/** HRTIM_TIMF_RSTFR_MSTCMP3 Master compare 3 **/
#define HRTIM_TIMF_RSTFR_MSTCMP3		(1 << 7)
/** HRTIM_TIMF_RSTFR_MSTCMP2 Master compare 2 **/
#define HRTIM_TIMF_RSTFR_MSTCMP2		(1 << 6)
/** HRTIM_TIMF_RSTFR_MSTCMP1 Master compare 1 **/
#define HRTIM_TIMF_RSTFR_MSTCMP1		(1 << 5)
/** HRTIM_TIMF_RSTFR_MSTPER Master timer Period **/
#define HRTIM_TIMF_RSTFR_MSTPER		(1 << 4)
/** HRTIM_TIMF_RSTFR_CMP4 Timer A compare 4 reset **/
#define HRTIM_TIMF_RSTFR_CMP4		(1 << 3)
/** HRTIM_TIMF_RSTFR_CMP2 Timer A compare 2 reset **/
#define HRTIM_TIMF_RSTFR_CMP2		(1 << 2)
/** HRTIM_TIMF_RSTFR_UPDT Timer A Update reset **/
#define HRTIM_TIMF_RSTFR_UPDT		(1 << 1)
/** HRTIM_TIMF_RSTFR_TIMFCMP1 Timer A Update reset **/
#define HRTIM_TIMF_RSTFR_TIMFCMP1		(1 << 0)

/**@}*/

/** @defgroup hrtim_timf_chpfr CHPFR Timerx Chopper Register
@{*/


#define HRTIM_TIMF_CHPFR_STRTPW_SHIFT		7
#define HRTIM_TIMF_CHPFR_STRTPW_MASK		0x0f
/** @defgroup hrtim_timf_chpfr_strtpw STRTPW STRTPW
@{*/
/**@}*/


#define HRTIM_TIMF_CHPFR_CHPDTY_SHIFT		4
#define HRTIM_TIMF_CHPFR_CHPDTY_MASK		0x07
/** @defgroup hrtim_timf_chpfr_chpdty CHPDTY Timerx chopper duty cycle value
@{*/
/**@}*/


#define HRTIM_TIMF_CHPFR_CHPFRQ_SHIFT		0
#define HRTIM_TIMF_CHPFR_CHPFRQ_MASK		0x0f
/** @defgroup hrtim_timf_chpfr_chpfrq CHPFRQ Timerx carrier frequency value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timf_cpt1fcr CPT1FCR Timerx Capture 2 Control Register
@{*/

/** HRTIM_TIMF_CPT1FCR_TECMP2 TECMP2 **/
#define HRTIM_TIMF_CPT1FCR_TECMP2		(1 << 31)
/** HRTIM_TIMF_CPT1FCR_TECMP1 TECMP1 **/
#define HRTIM_TIMF_CPT1FCR_TECMP1		(1 << 30)
/** HRTIM_TIMF_CPT1FCR_TE1RST TE1RST **/
#define HRTIM_TIMF_CPT1FCR_TE1RST		(1 << 29)
/** HRTIM_TIMF_CPT1FCR_TE1SET TE1SET **/
#define HRTIM_TIMF_CPT1FCR_TE1SET		(1 << 28)
/** HRTIM_TIMF_CPT1FCR_TDCMP2 Timer D Compare 2 **/
#define HRTIM_TIMF_CPT1FCR_TDCMP2		(1 << 27)
/** HRTIM_TIMF_CPT1FCR_TDCMP1 Timer D Compare 1 **/
#define HRTIM_TIMF_CPT1FCR_TDCMP1		(1 << 26)
/** HRTIM_TIMF_CPT1FCR_TD1RST Timer D output 1 Reset **/
#define HRTIM_TIMF_CPT1FCR_TD1RST		(1 << 25)
/** HRTIM_TIMF_CPT1FCR_TD1SET Timer D output 1 Set **/
#define HRTIM_TIMF_CPT1FCR_TD1SET		(1 << 24)
/** HRTIM_TIMF_CPT1FCR_TCCMP2 Timer C Compare 2 **/
#define HRTIM_TIMF_CPT1FCR_TCCMP2		(1 << 23)
/** HRTIM_TIMF_CPT1FCR_TCCMP1 Timer C Compare 1 **/
#define HRTIM_TIMF_CPT1FCR_TCCMP1		(1 << 22)
/** HRTIM_TIMF_CPT1FCR_TC1RST Timer C output 1 Reset **/
#define HRTIM_TIMF_CPT1FCR_TC1RST		(1 << 21)
/** HRTIM_TIMF_CPT1FCR_TC1SET Timer C output 1 Set **/
#define HRTIM_TIMF_CPT1FCR_TC1SET		(1 << 20)
/** HRTIM_TIMF_CPT1FCR_TBCMP2 Timer B Compare 2 **/
#define HRTIM_TIMF_CPT1FCR_TBCMP2		(1 << 19)
/** HRTIM_TIMF_CPT1FCR_TBCMP1 Timer B Compare 1 **/
#define HRTIM_TIMF_CPT1FCR_TBCMP1		(1 << 18)
/** HRTIM_TIMF_CPT1FCR_TB1RST Timer B output 1 Reset **/
#define HRTIM_TIMF_CPT1FCR_TB1RST		(1 << 17)
/** HRTIM_TIMF_CPT1FCR_TB1SET Timer B output 1 Set **/
#define HRTIM_TIMF_CPT1FCR_TB1SET		(1 << 16)
/** HRTIM_TIMF_CPT1FCR_TACMP2 Timer A Compare 2 **/
#define HRTIM_TIMF_CPT1FCR_TACMP2		(1 << 15)
/** HRTIM_TIMF_CPT1FCR_TACMP1 Timer A Compare 1 **/
#define HRTIM_TIMF_CPT1FCR_TACMP1		(1 << 14)
/** HRTIM_TIMF_CPT1FCR_TA1RST Timer A output 1 Reset **/
#define HRTIM_TIMF_CPT1FCR_TA1RST		(1 << 13)
/** HRTIM_TIMF_CPT1FCR_TA1SET Timer A output 1 Set **/
#define HRTIM_TIMF_CPT1FCR_TA1SET		(1 << 12)
/** HRTIM_TIMF_CPT1FCR_EXEV10CPT External Event 10 Capture **/
#define HRTIM_TIMF_CPT1FCR_EXEV10CPT		(1 << 11)
/** HRTIM_TIMF_CPT1FCR_EXEV9CPT External Event 9 Capture **/
#define HRTIM_TIMF_CPT1FCR_EXEV9CPT		(1 << 10)
/** HRTIM_TIMF_CPT1FCR_EXEV8CPT External Event 8 Capture **/
#define HRTIM_TIMF_CPT1FCR_EXEV8CPT		(1 << 9)
/** HRTIM_TIMF_CPT1FCR_EXEV7CPT External Event 7 Capture **/
#define HRTIM_TIMF_CPT1FCR_EXEV7CPT		(1 << 8)
/** HRTIM_TIMF_CPT1FCR_EXEV6CPT External Event 6 Capture **/
#define HRTIM_TIMF_CPT1FCR_EXEV6CPT		(1 << 7)
/** HRTIM_TIMF_CPT1FCR_EXEV5CPT External Event 5 Capture **/
#define HRTIM_TIMF_CPT1FCR_EXEV5CPT		(1 << 6)
/** HRTIM_TIMF_CPT1FCR_EXEV4CPT External Event 4 Capture **/
#define HRTIM_TIMF_CPT1FCR_EXEV4CPT		(1 << 5)
/** HRTIM_TIMF_CPT1FCR_EXEV3CPT External Event 3 Capture **/
#define HRTIM_TIMF_CPT1FCR_EXEV3CPT		(1 << 4)
/** HRTIM_TIMF_CPT1FCR_EXEV2CPT External Event 2 Capture **/
#define HRTIM_TIMF_CPT1FCR_EXEV2CPT		(1 << 3)
/** HRTIM_TIMF_CPT1FCR_EXEV1CPT External Event 1 Capture **/
#define HRTIM_TIMF_CPT1FCR_EXEV1CPT		(1 << 2)
/** HRTIM_TIMF_CPT1FCR_UDPCPT Update Capture **/
#define HRTIM_TIMF_CPT1FCR_UDPCPT		(1 << 1)
/** HRTIM_TIMF_CPT1FCR_SWCPT Software Capture **/
#define HRTIM_TIMF_CPT1FCR_SWCPT		(1 << 0)

/**@}*/

/** @defgroup hrtim_timf_cpt2fcr CPT2FCR CPT2xCR
@{*/

/** HRTIM_TIMF_CPT2FCR_TECMP2 TECMP2 **/
#define HRTIM_TIMF_CPT2FCR_TECMP2		(1 << 31)
/** HRTIM_TIMF_CPT2FCR_TECMP1 TECMP1 **/
#define HRTIM_TIMF_CPT2FCR_TECMP1		(1 << 30)
/** HRTIM_TIMF_CPT2FCR_TE1RST TE1RST **/
#define HRTIM_TIMF_CPT2FCR_TE1RST		(1 << 29)
/** HRTIM_TIMF_CPT2FCR_TE1SET TE1SET **/
#define HRTIM_TIMF_CPT2FCR_TE1SET		(1 << 28)
/** HRTIM_TIMF_CPT2FCR_TDCMP2 Timer D Compare 2 **/
#define HRTIM_TIMF_CPT2FCR_TDCMP2		(1 << 27)
/** HRTIM_TIMF_CPT2FCR_TDCMP1 Timer D Compare 1 **/
#define HRTIM_TIMF_CPT2FCR_TDCMP1		(1 << 26)
/** HRTIM_TIMF_CPT2FCR_TD1RST Timer D output 1 Reset **/
#define HRTIM_TIMF_CPT2FCR_TD1RST		(1 << 25)
/** HRTIM_TIMF_CPT2FCR_TD1SET Timer D output 1 Set **/
#define HRTIM_TIMF_CPT2FCR_TD1SET		(1 << 24)
/** HRTIM_TIMF_CPT2FCR_TCCMP2 Timer C Compare 2 **/
#define HRTIM_TIMF_CPT2FCR_TCCMP2		(1 << 23)
/** HRTIM_TIMF_CPT2FCR_TCCMP1 Timer C Compare 1 **/
#define HRTIM_TIMF_CPT2FCR_TCCMP1		(1 << 22)
/** HRTIM_TIMF_CPT2FCR_TC1RST Timer C output 1 Reset **/
#define HRTIM_TIMF_CPT2FCR_TC1RST		(1 << 21)
/** HRTIM_TIMF_CPT2FCR_TC1SET Timer C output 1 Set **/
#define HRTIM_TIMF_CPT2FCR_TC1SET		(1 << 20)
/** HRTIM_TIMF_CPT2FCR_TBCMP2 Timer B Compare 2 **/
#define HRTIM_TIMF_CPT2FCR_TBCMP2		(1 << 19)
/** HRTIM_TIMF_CPT2FCR_TBCMP1 Timer B Compare 1 **/
#define HRTIM_TIMF_CPT2FCR_TBCMP1		(1 << 18)
/** HRTIM_TIMF_CPT2FCR_TB1RST Timer B output 1 Reset **/
#define HRTIM_TIMF_CPT2FCR_TB1RST		(1 << 17)
/** HRTIM_TIMF_CPT2FCR_TB1SET Timer B output 1 Set **/
#define HRTIM_TIMF_CPT2FCR_TB1SET		(1 << 16)
/** HRTIM_TIMF_CPT2FCR_TACMP2 Timer A Compare 2 **/
#define HRTIM_TIMF_CPT2FCR_TACMP2		(1 << 15)
/** HRTIM_TIMF_CPT2FCR_TACMP1 Timer A Compare 1 **/
#define HRTIM_TIMF_CPT2FCR_TACMP1		(1 << 14)
/** HRTIM_TIMF_CPT2FCR_TA1RST Timer A output 1 Reset **/
#define HRTIM_TIMF_CPT2FCR_TA1RST		(1 << 13)
/** HRTIM_TIMF_CPT2FCR_TA1SET Timer A output 1 Set **/
#define HRTIM_TIMF_CPT2FCR_TA1SET		(1 << 12)
/** HRTIM_TIMF_CPT2FCR_EXEV10CPT External Event 10 Capture **/
#define HRTIM_TIMF_CPT2FCR_EXEV10CPT		(1 << 11)
/** HRTIM_TIMF_CPT2FCR_EXEV9CPT External Event 9 Capture **/
#define HRTIM_TIMF_CPT2FCR_EXEV9CPT		(1 << 10)
/** HRTIM_TIMF_CPT2FCR_EXEV8CPT External Event 8 Capture **/
#define HRTIM_TIMF_CPT2FCR_EXEV8CPT		(1 << 9)
/** HRTIM_TIMF_CPT2FCR_EXEV7CPT External Event 7 Capture **/
#define HRTIM_TIMF_CPT2FCR_EXEV7CPT		(1 << 8)
/** HRTIM_TIMF_CPT2FCR_EXEV6CPT External Event 6 Capture **/
#define HRTIM_TIMF_CPT2FCR_EXEV6CPT		(1 << 7)
/** HRTIM_TIMF_CPT2FCR_EXEV5CPT External Event 5 Capture **/
#define HRTIM_TIMF_CPT2FCR_EXEV5CPT		(1 << 6)
/** HRTIM_TIMF_CPT2FCR_EXEV4CPT External Event 4 Capture **/
#define HRTIM_TIMF_CPT2FCR_EXEV4CPT		(1 << 5)
/** HRTIM_TIMF_CPT2FCR_EXEV3CPT External Event 3 Capture **/
#define HRTIM_TIMF_CPT2FCR_EXEV3CPT		(1 << 4)
/** HRTIM_TIMF_CPT2FCR_EXEV2CPT External Event 2 Capture **/
#define HRTIM_TIMF_CPT2FCR_EXEV2CPT		(1 << 3)
/** HRTIM_TIMF_CPT2FCR_EXEV1CPT External Event 1 Capture **/
#define HRTIM_TIMF_CPT2FCR_EXEV1CPT		(1 << 2)
/** HRTIM_TIMF_CPT2FCR_UDPCPT Update Capture **/
#define HRTIM_TIMF_CPT2FCR_UDPCPT		(1 << 1)
/** HRTIM_TIMF_CPT2FCR_SWCPT Software Capture **/
#define HRTIM_TIMF_CPT2FCR_SWCPT		(1 << 0)

/**@}*/

/** @defgroup hrtim_timf_outfr OUTFR Timerx Output Register
@{*/

/** HRTIM_TIMF_OUTFR_DIDL2 Output 2 Deadtime upon burst mode Idle entry **/
#define HRTIM_TIMF_OUTFR_DIDL2		(1 << 23)
/** HRTIM_TIMF_OUTFR_CHP2 Output 2 Chopper enable **/
#define HRTIM_TIMF_OUTFR_CHP2		(1 << 22)

#define HRTIM_TIMF_OUTFR_FAULT2_SHIFT		20
#define HRTIM_TIMF_OUTFR_FAULT2_MASK		0x03
/** @defgroup hrtim_timf_outfr_fault2 FAULT2 Output 2 Fault state
@{*/
/**@}*/

/** HRTIM_TIMF_OUTFR_IDLES2 Output 2 Idle State **/
#define HRTIM_TIMF_OUTFR_IDLES2		(1 << 19)
/** HRTIM_TIMF_OUTFR_IDLEM2 Output 2 Idle mode **/
#define HRTIM_TIMF_OUTFR_IDLEM2		(1 << 18)
/** HRTIM_TIMF_OUTFR_POL2 Output 2 polarity **/
#define HRTIM_TIMF_OUTFR_POL2		(1 << 17)
/** HRTIM_TIMF_OUTFR_BIAR Balanced Idle Automatic Resume **/
#define HRTIM_TIMF_OUTFR_BIAR		(1 << 14)

#define HRTIM_TIMF_OUTFR_DLYPRT_SHIFT		10
#define HRTIM_TIMF_OUTFR_DLYPRT_MASK		0x07
/** @defgroup hrtim_timf_outfr_dlyprt DLYPRT Delayed Protection
@{*/
/**@}*/

