grevaillot/svd_tools/headers/STM32G474xx/hrtim_timf.h
/** HRTIM_TIMF_OUTFR_DLYPRTEN Delayed Protection Enable **/
#define HRTIM_TIMF_OUTFR_DLYPRTEN		(1 << 9)
/** HRTIM_TIMF_OUTFR_DTEN Deadtime enable **/
#define HRTIM_TIMF_OUTFR_DTEN		(1 << 8)
/** HRTIM_TIMF_OUTFR_DIDL1 Output 1 Deadtime upon burst mode Idle entry **/
#define HRTIM_TIMF_OUTFR_DIDL1		(1 << 7)
/** HRTIM_TIMF_OUTFR_CHP1 Output 1 Chopper enable **/
#define HRTIM_TIMF_OUTFR_CHP1		(1 << 6)

#define HRTIM_TIMF_OUTFR_FAULT1_SHIFT		4
#define HRTIM_TIMF_OUTFR_FAULT1_MASK		0x03
/** @defgroup hrtim_timf_outfr_fault1 FAULT1 Output 1 Fault state
@{*/
/**@}*/

/** HRTIM_TIMF_OUTFR_IDLES1 Output 1 Idle State **/
#define HRTIM_TIMF_OUTFR_IDLES1		(1 << 3)
/** HRTIM_TIMF_OUTFR_IDLEM1 Output 1 Idle mode **/
#define HRTIM_TIMF_OUTFR_IDLEM1		(1 << 2)
/** HRTIM_TIMF_OUTFR_POL1 Output 1 polarity **/
#define HRTIM_TIMF_OUTFR_POL1		(1 << 1)

/**@}*/

/** @defgroup hrtim_timf_fltfr FLTFR Timerx Fault Register
@{*/

/** HRTIM_TIMF_FLTFR_FLTLCK Fault sources Lock **/
#define HRTIM_TIMF_FLTFR_FLTLCK		(1 << 31)
/** HRTIM_TIMF_FLTFR_FLT6EN Fault 6 enable **/
#define HRTIM_TIMF_FLTFR_FLT6EN		(1 << 5)
/** HRTIM_TIMF_FLTFR_FLT5EN Fault 5 enable **/
#define HRTIM_TIMF_FLTFR_FLT5EN		(1 << 4)
/** HRTIM_TIMF_FLTFR_FLT4EN Fault 4 enable **/
#define HRTIM_TIMF_FLTFR_FLT4EN		(1 << 3)
/** HRTIM_TIMF_FLTFR_FLT3EN Fault 3 enable **/
#define HRTIM_TIMF_FLTFR_FLT3EN		(1 << 2)
/** HRTIM_TIMF_FLTFR_FLT2EN Fault 2 enable **/
#define HRTIM_TIMF_FLTFR_FLT2EN		(1 << 1)
/** HRTIM_TIMF_FLTFR_FLT1EN Fault 1 enable **/
#define HRTIM_TIMF_FLTFR_FLT1EN		(1 << 0)

/**@}*/

/** @defgroup hrtim_timf_timfcr2 TIMFCR2 HRTIM Timerx Control Register 2
@{*/

/** HRTIM_TIMF_TIMFCR2_TRGHLF Triggered-half mode **/
#define HRTIM_TIMF_TIMFCR2_TRGHLF		(1 << 20)
/** HRTIM_TIMF_TIMFCR2_GTCMP3 Greater than Compare 3 PWM mode **/
#define HRTIM_TIMF_TIMFCR2_GTCMP3		(1 << 17)
/** HRTIM_TIMF_TIMFCR2_GTCMP1 Greater than Compare 1 PWM mode **/
#define HRTIM_TIMF_TIMFCR2_GTCMP1		(1 << 16)

#define HRTIM_TIMF_TIMFCR2_FEROM_SHIFT		14
#define HRTIM_TIMF_TIMFCR2_FEROM_MASK		0x03
/** @defgroup hrtim_timf_timfcr2_ferom FEROM Fault and Event Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIMF_TIMFCR2_BMROM_SHIFT		12
#define HRTIM_TIMF_TIMFCR2_BMROM_MASK		0x03
/** @defgroup hrtim_timf_timfcr2_bmrom BMROM Burst Mode Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIMF_TIMFCR2_ADROM_SHIFT		10
#define HRTIM_TIMF_TIMFCR2_ADROM_MASK		0x03
/** @defgroup hrtim_timf_timfcr2_adrom ADROM ADC Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIMF_TIMFCR2_OUTROM_SHIFT		8
#define HRTIM_TIMF_TIMFCR2_OUTROM_MASK		0x03
/** @defgroup hrtim_timf_timfcr2_outrom OUTROM Output Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIMF_TIMFCR2_ROM_SHIFT		6
#define HRTIM_TIMF_TIMFCR2_ROM_MASK		0x03
/** @defgroup hrtim_timf_timfcr2_rom ROM Roll-Over Mode
@{*/
/**@}*/

/** HRTIM_TIMF_TIMFCR2_UDM Up-Down Mode **/
#define HRTIM_TIMF_TIMFCR2_UDM		(1 << 4)
/** HRTIM_TIMF_TIMFCR2_DCDR Dual Channel DAC Reset trigger **/
#define HRTIM_TIMF_TIMFCR2_DCDR		(1 << 2)
/** HRTIM_TIMF_TIMFCR2_DCDS Dual Channel DAC Step trigger **/
#define HRTIM_TIMF_TIMFCR2_DCDS		(1 << 1)
/** HRTIM_TIMF_TIMFCR2_DCDE Dual Channel DAC trigger enable **/
#define HRTIM_TIMF_TIMFCR2_DCDE		(1 << 0)

/**@}*/

/** @defgroup hrtim_timf_feefr3 FEEFR3 HRTIM Timerx External Event Filtering Register 3
@{*/


#define HRTIM_TIMF_FEEFR3_EEVACNT_SHIFT		8
#define HRTIM_TIMF_FEEFR3_EEVACNT_MASK		0x3f
/** @defgroup hrtim_timf_feefr3_eevacnt EEVACNT External Event A counter
@{*/
/**@}*/


#define HRTIM_TIMF_FEEFR3_EEVASEL_SHIFT		4
#define HRTIM_TIMF_FEEFR3_EEVASEL_MASK		0x0f
/** @defgroup hrtim_timf_feefr3_eevasel EEVASEL External Event A Selection
@{*/
/**@}*/

/** HRTIM_TIMF_FEEFR3_EEVARSTM External Event A Reset Mode **/
#define HRTIM_TIMF_FEEFR3_EEVARSTM		(1 << 2)
/** HRTIM_TIMF_FEEFR3_EEVACRES External Event A Counter Reset **/
#define HRTIM_TIMF_FEEFR3_EEVACRES		(1 << 1)
/** HRTIM_TIMF_FEEFR3_EEVACE External Event A Counter Enable **/
#define HRTIM_TIMF_FEEFR3_EEVACE		(1 << 0)

/**@}*/
